const foods = [
    {
        id: '1',
        name: 'กาแฟสด',
        type: 'เครื่องดื่ม',
        price: '10',
        shop_id: '1',
        tag: "เครื่องดื่ม,กาแฟ"
    },
    {
        id: '2',
        name: 'ชาเขียว',
        type: 'เครื่องดื่ม',
        price: '10',
        shop_id: '1',
        tag: "เครื่องดื่ม,ชา"
    },
    {
        id: '3',
        name: 'ชาเย็น',
        type: 'เครื่องดื่ม',
        price: '10',
        shop_id: '2',
        tag: "เครื่องดื่ม,ชา"
    },
    {
        id: '4',
        name: 'ชามะนาว',
        type: 'เครื่องดื่ม',
        price: '10',
        shop_id: '2',
        tag: "เครื่องดื่ม,ชา"
    },
    {
        id: '5',
        name: 'น้ำใบเตย',
        type: 'เครื่องดื่ม',
        price: '10',
        shop_id: '2',
        tag: "เครื่องดื่ม,น้ำผลไม้"
    },
    {
        id: '6',
        name: 'น้ำลำใย',
        type: 'เครื่องดื่ม',
        price: '10',
        shop_id: '2',
        tag: "เครื่องดื่ม,น้ำผลไม้"
    },
    {
        id: '7',
        name: 'น้ำกระเจี๊ยบ',
        type: 'เครื่องดื่ม',
        price: '10',
        shop_id: '2',
        tag: "เครื่องดื่ม,น้ำผลไม้"
    },
    {
        id: '8',
        name: 'แกงเขียวหวานไก่',
        type: 'อาหาร',
        price: '25',
        shop_id: '3',
        tag: "อาหาร,ข้าว,ไก่,ฮาลาล"
    },
    {
        id: '9',
        name: 'แกงข่า',
        type: 'อาหาร',
        price: '25',
        shop_id: '3',
        tag: "อาหาร,ข้าว,ไก่,ฮาลาล"
    },
    {
        id: '10',
        name: 'ข้าวหมูกรอบ',
        type: 'อาหาร',
        price: '30',
        shop_id: '4',
        tag: "อาหาร,ข้าว,หมู"
    },
    {
        id: '11',
        name: 'บะหมี่เกี๊ยวหมูกรอบ/หมูแดง',
        type: 'ก๋วยเตี๋ยว',
        price: '25',
        shop_id: '4',
        tag: "อาหาร,เส้น,หมู"
    },
    {
        id: '12',
        name: 'ก๋วยเตี๋ยวต้มยำ',
        type: 'ก๋วยเตี๋ยว',
        price: '25',
        shop_id: '4',
        tag: "อาหาร,เส้น,หมู"
    },
    {
        id: '13',
        name: 'ก๋วยเตี๊ยวเย็นตาโฟ',
        type: 'ก๋วยเตี๋ยว',
        price: '25',
        shop_id: '4',
        tag: "อาหาร,เส้น,หมู"
    },
    {
        id: '14',
        name: 'หมูสามชั้นทอด',
        type: 'อาหาร',
        price: '30',
        shop_id: '5',
        tag: "อาหาร,ข้าว,หมู"
    },
    {
        id: '15',
        name: 'ผัดเผ็ดปลาดุกใบยี่หร่า',
        type: 'อาหาร',
        price: '30',
        shop_id: '5',
        tag: "อาหาร,ข้าว,ปลา"
    },
    {
        id: '16',
        name: 'ข้าวไก่ทอดราดแกงกะหรี่',
        type: 'อาหาร',
        price: '30',
        shop_id: '6',
        tag: "อาหาร,ข้าว,ไก่"
    },
    {
        id: '17',
        name: 'มัสมั่น',
        type: 'อาหาร',
        price: '30',
        shop_id: '6',
        tag: "อาหาร,ข้าว,ไก่"
    },
    {
        id: '18',
        name: 'ไก่ย่างซอสกะเพรา',
        type: 'อาหาร',
        price: '30',
        shop_id: '6',
        tag: "อาหาร,ข้าว,ไก่"
    },
    {
        id: '19',
        name: 'ไก่ย่างมัสมั่นไก่',
        type: 'อาหาร',
        price: '30',
        shop_id: '6',
        tag: "อาหาร,ข้าว,ไก่"
    },
    {
        id: '20',
        name: 'ข้าวหมกไก่',
        type: 'อาหาร',
        price: '30',
        shop_id: '6',
        tag: "อาหาร,ข้าว,ไก่"
    },
    {
        id: '21',
        name: 'หมูเกาหลี',
        type: 'อาหาร',
        price: '35',
        shop_id: '7',
        tag: "อาหาร,ข้าว,หมู"
    },
    {
        id: '22',
        name: 'แกงกะหรี่',
        type: 'อาหาร',
        price: '35',
        shop_id: '7',
        tag: "อาหาร,ข้าว,ไก่"
    },
    {
        id: '23',
        name: 'ไก่แซ่บ',
        type: 'อาหาร',
        price: '30',
        shop_id: '7',
        tag: "อาหาร,ข้าว,ไก่"
    },
    {
        id: '24',
        name: 'ไก่ทอดผัดซอส',
        type: 'อาหาร',
        price: '25',
        shop_id: '8',
        tag: "อาหาร,ข้าว,ไก่,ฮาลาล"
    },
    {
        id: '25',
        name: 'ยำผักรวมทอด',
        type: 'อาหาร',
        price: '25',
        shop_id: '8',
        tag: "อาหาร,ข้าว,ฮาลาล"
    },
    {
        id: '26',
        name: 'ปลานึ่งมะนาว',
        type: 'อาหาร',
        price: '20',
        shop_id: '8',
        tag: "อาหาร,ข้าว,ปลา,ฮาลาล"
    },
    {
        id: '27',
        name: 'ไก่ทอด',
        type: 'อาหาร',
        price: '25',
        shop_id: '8',
        tag: "อาหาร,ข้าว,ไก่,ฮาลาล"
    },
    {
        id: '28',
        name: 'แกงยอดมะพร้าว',
        type: 'อาหาร',
        price: '25',
        shop_id: '8',
        tag: "อาหาร,ข้าว,ไก่,ฮาลาล"
    },
    {
        id: '29',
        name: 'ไข่ตุ๋น',
        type: 'อาหาร',
        price: '25',
        shop_id: '8',
        tag: "อาหาร,ข้าว,ฮาลาล"
    },
    {
        id: '30',
        name: 'ข้าวไก่ย่างน้ำจิ้มแจ่ว',
        type: 'อาหาร',
        price: '30',
        shop_id: '9',
        tag: "อาหาร,ข้าว,ไก่"
    },
    {
        id: '31',
        name: 'ข้าวแกงกะหรี่ไก่ทอด',
        type: 'อาหาร',
        price: '30',
        shop_id: '9',
        tag: "อาหาร,ข้าว,ไก่"
    },
    {
        id: '32',
        name: 'ขนมจีนแกงเขียวหวานไก่',
        type: 'อาหาร',
        price: '25',
        shop_id: '9',
        tag: "อาหาร,เส้น,ไก่"
    },
    {
        id: '33',
        name: 'ไก่ทอดซอสเปรี้ยวหวาน',
        type: 'อาหาร',
        price: '25',
        shop_id: '9',
        tag: "อาหาร,ข้าว,ไก่"
    },
    {
        id: '34',
        name: 'ผัดเผ็ดปลาดุก',
        type: 'อาหาร',
        price: '25',
        shop_id: '10',
        tag: "อาหาร,ข้าว,ปลา"
    },
    {
        id: '35',
        name: 'ไก่คั่วพริก',
        type: 'อาหาร',
        price: '25',
        shop_id: '10',
        tag: "อาหาร,ข้าว,ไก่"
    },
    {
        id: '36',
        name: 'ผัดกะเพราหมูสับ',
        type: 'อาหาร',
        price: '25',
        shop_id: '10',
        tag: "อาหาร,ข้าว,หมู"
    },
    {
        id: '37',
        name: 'น้ำส้ม',
        type: 'เครื่องดื่ม',
        price: '10',
        shop_id: '11',
        tag: "เครื่องดื่ม,น้ำผลไม้"
    },
    {
        id: '38',
        name: 'นมเย็น',
        type: 'เครื่องดื่ม',
        price: '10',
        shop_id: '11',
        tag: "เครื่องดื่ม,นม"
    },
    {
        id: '39',
        name: 'น้ำมะพร้าว',
        type: 'เครื่องดื่ม',
        price: '10',
        shop_id: '11',
        tag: "เครื่องดื่ม,น้ำผลไม้"
    }
]

exports.seed = function (knex) {
    return knex('foods').del().then(function () {
        return knex('foods').insert(foods);
    });
};
